Tekla.Structures.Model.RebarSetExtensions
The rebar set extensions class.

Tekla.Structures.Model.RebarSetExtensions.MaxContourPoints
The maximum contour points.

Tekla.Structures.Model.RebarSetExtensions.GetActualBarDiameter(Tekla.Structures.Model.RebarSet)
Gets the actual bar diameter for the rebarset.
rebarSet: The rebarset.
Returns: The bar diameter matching Grade, size and bending radius.

Tekla.Structures.Model.RebarSetExtensions.CalculateSpacingActuals(Tekla.Structures.Model.RebarGuideline,System.Double)
Calculates the guideline spacing 'actuals'.
guideline: The guideline.
guidelineLength: The guideline length.
Returns: A Tekla.Structures.Model.RebarSpacing populated with the calculated 'actual' values.

Tekla.Structures.Model.RebarSetExtensions.ResolveAutomaticOffsets(Tekla.Structures.Model.RebarGuideline,System.Int32)
Calculates the spacing start/end offsets if those values are set to automatic.
guideline: The guideline.
rebarSetId: The rebar set id.

Tekla.Structures.Model.RebarSetExtensions.GetActualCurve(Tekla.Structures.Model.RebarGuideline,System.Int32,System.Double@)
Gets the guideline 'actual' curve.
guideline: The guideline.
rebarsetId: The rebarset ID.
curveLength: The curve length.
Returns: A list of Segment3 and Arc3 objects.

Tekla.Structures.Model.RebarSetExtensions.GetActualCurve(Tekla.Structures.Model.BaseRebarModifier,System.Double@)
Gets the modifier 'actual' curve.
modifier: The modifier.
curveLength: The curve length.
Returns: A list of Segment3 and Arc3 objects.

Tekla.Structures.Model.RebarSetExtensions.GetActualCurve(Tekla.Structures.Model.RebarGuideline,System.Int32,System.Boolean@)
Gets the guideline 'actual' curve.
guideline: The guideline.
rebarsetId: The rebarset ID.
followsEdges: The curve follows an edge.
Returns: A list of Segment3 and Arc3 objects.

Tekla.Structures.Model.RebarSetExtensions.GetActualCurve(Tekla.Structures.Model.BaseRebarModifier,System.Boolean@)
Gets the modifier 'actual' curve.
modifier: The modifier.
followsEdge: The curve follows an edge.
Returns: A list of Segment3 and Arc3 objects.

Tekla.Structures.Model.RebarSetExtensions.TryGetClosestEdge(Tekla.Structures.Model.RebarSet,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Segment3@)
Gets the geometric segment of rebarSet that is closest to the given Tekla.Common.Geometry.Vector3 value.
rebarSet: The Tekla.Structures.Model.RebarSet to get the closest segment from.
point: The Tekla.Common.Geometry.Vector3 to get the closest segment to.
closestEdge: The Tekla.Common.Geometry.Segment3 of the given Tekla.Structures.Model.RebarSplice that is closest to point.
Returns: True if rebarSet defines any segment; otherwise, false.

Tekla.Structures.Model.RebarSetExtensions.TryGetClosestFace3(Tekla.Structures.Model.RebarSet,Tekla.Common.Geometry.Vector3,Tekla.BIM.Geometry.Face3@)
Tries to resolve the closest face on rebarSet to point.
rebarSet: The tolerated Tekla.Structures.Model.RebarSet.
point: The hit point on the tolerated object.
closestFace: The closest face of rebarSet.
Returns: True if rebarSet defines resolvable faces; otherwise, false.

Tekla.Structures.Model.RebarSetExtensions.GetBarSurface(Tekla.Structures.Model.RebarSet,System.Int32)
Gets the bars surface from which this bar was spawned.
rebarSet: The rebar set.
barId: The id of the virtual bar.
Returns: A Tekla.Common.Geometry.Plane3 or a Tekla.Common.Geometry.Cylinder3.

Tekla.Structures.Model.RebarSetExtensions.GetAppliedAttributes(Tekla.Structures.Model.RebarSet)
Gets the rebarset applied attributes.
rebarSet: The rebar set.

Tekla.Structures.Model.RebarSetExtensions.GetAppliedAttributes(Tekla.Structures.Model.BaseRebarModifier)
Get the strip applied attributes.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.GetAppliedAttributes(Tekla.Structures.Model.RebarEndDetailModifier)
Gets the end-detail strip applied attributes.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.GetAppliedAttributes(Tekla.Structures.Model.RebarPropertyModifier)
Gets the property strip applied attributes.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.GetAppliedAttributes(Tekla.Structures.Model.RebarSplitter)
Gets the splitter strip applied attributes.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.SetAppliedAttributes(Tekla.Structures.Model.RebarSet)
Sets the rebarset applied attributes.
rebarSet: The rebar set.

Tekla.Structures.Model.RebarSetExtensions.SetAppliedAttributes(Tekla.Structures.Model.BaseRebarModifier)
Sets the strip applied attributes.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.SetAppliedAttributes(Tekla.Structures.Model.RebarEndDetailModifier)
Sets the end-detail strip applied attributes.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.SetAppliedAttributes(Tekla.Structures.Model.RebarPropertyModifier)
Sets the property strip applied attributes.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.SetAppliedAttributes(Tekla.Structures.Model.RebarSplitter)
Sets the splitter strip applied attributes.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.LoadDialogAttributes(Tekla.Structures.Model.RebarSet,System.String)
Loads the rebarset dialog attributes.
rebarSet: The rebar set.
filename: The filename.

Tekla.Structures.Model.RebarSetExtensions.LoadDialogAttributes(Tekla.Structures.Model.RebarEndDetailModifier,System.String)
Loads the end-detail strip applied attributes.
strip: The strip.
filename: The filename.

Tekla.Structures.Model.RebarSetExtensions.LoadDialogAttributes(Tekla.Structures.Model.RebarPropertyModifier,System.String)
Loads the property strip applied attributes.
strip: The strip.
filename: The filename.

Tekla.Structures.Model.RebarSetExtensions.LoadDialogAttributes(Tekla.Structures.Model.RebarSplitter,System.String)
Loads the splitter strip applied attributes.
strip: The strip.
filename: The filename.

Tekla.Structures.Model.RebarSetExtensions.LoadDialogAttributes(Tekla.Structures.Model.BaseRebarModifier,System.String)
Loads strip applied attributes.
strip: The strip.
filename: The filename.

Tekla.Structures.Model.RebarSetExtensions.SaveDialogAttributes(Tekla.Structures.Model.RebarSet,System.String)
Saves the rebarset dialog attributes.
rebarSet: The rebar set.
filename: The filename.

Tekla.Structures.Model.RebarSetExtensions.SaveDialogAttributes(Tekla.Structures.Model.RebarEndDetailModifier,System.String)
Saves the end-detail strip applied attributes.
strip: The strip.
filename: The filename.

Tekla.Structures.Model.RebarSetExtensions.SaveDialogAttributes(Tekla.Structures.Model.RebarPropertyModifier,System.String)
Saves the property strip applied attributes.
strip: The strip.
filename: The filename.

Tekla.Structures.Model.RebarSetExtensions.SaveDialogAttributes(Tekla.Structures.Model.RebarSplitter,System.String)
Saves the splitter strip applied attributes.
strip: The strip.
filename: The filename.

Tekla.Structures.Model.RebarSetExtensions.SaveDialogAttributes(Tekla.Structures.Model.BaseRebarModifier,System.String)
Saves the strip applied attributes.
strip: The strip.
filename: The filename.

Tekla.Structures.Model.RebarSetExtensions.DisplayUDAsDialog(Tekla.Structures.Model.RebarSet)
Displays the rebar set UDAs dialog.
rebarSet: The rebar set.

Tekla.Structures.Model.RebarSetExtensions.DisplayUDAsDialog(Tekla.Structures.Model.RebarPropertyModifier)
Displays the property strip UDAs dialog.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.GetAppliedUDAs(Tekla.Structures.Model.RebarSet)
Gets the rebar set applied UDAs.
rebarSet: The rebar set.
Returns: A dictionary of UDA names/values.

Tekla.Structures.Model.RebarSetExtensions.GetAppliedUDAs(Tekla.Structures.Model.RebarPropertyModifier)
Gets the property strip applied UDAs.
strip: The strip.
Returns: A dictionary of UDA names/values.

Tekla.Structures.Model.RebarSetExtensions.GetAppliedUDAs(Tekla.Structures.Model.RebarEndDetailModifier)
Gets the end detail strip applied UDAs.
strip: The strip.
Returns: A dictionary of UDA names/values.

Tekla.Structures.Model.RebarSetExtensions.SetUDAsOn(Tekla.Structures.Model.ModelObject,System.Collections.Generic.IEnumerable{System.Collections.Generic.KeyValuePair{System.String,System.Object}})
Set the given UDAs on the given model object.
modelObject: The model object.
udas: The udas.

Tekla.Structures.Model.RebarSetExtensions.CloneModifier(Tekla.Structures.Model.RebarEndDetailModifier)
Clones the end detail modifier.
strip: The strip.
Returns: The cloned end detail modifier.

Tekla.Structures.Model.RebarSetExtensions.CloneModifier(Tekla.Structures.Model.RebarPropertyModifier)
Clones the rebar property modifier.
strip: The strip.
Returns: The cloned rebar property modifier.

Tekla.Structures.Model.RebarSetExtensions.CloneModifier(Tekla.Structures.Model.RebarSplitter)
Clones the rebar splitter modifier.
strip: The strip.
Returns: The cloned rebar splitter modifier.

Tekla.Structures.Model.RebarSetExtensions.CloneModifier(Tekla.Structures.Model.BaseRebarModifier)
Clones the modifier.
strip: The strip.
Returns: The cloned modifier.

Tekla.Structures.Model.RebarSetExtensions.CheckForAndHandleNewCreatedDuplicates(Tekla.Structures.Model.BaseRebarModifier)
Checks whether given newly created object has duplicates in place.
If duplicate found, user prompt opens and asks user to keep, delete or cancel.
strip: The strip.
Returns: True if user opted to delete the newly created duplicate object; otherwise, false.

Tekla.Structures.Model.RebarSetExtensions.ChangeLegFaceLayer(Tekla.Structures.Model.RebarSet,System.Collections.Generic.List{System.Int32},Tekla.Structures.Model.RebarSetExtensions.LayerChangeEnum)
Changes the layer of the given leg-faces.
rebarSet: The rebar set.
legFaceIds: The ids of leg faces and leg surfaces to change.
layerChange: The change.
Returns: True if successful.

Tekla.Structures.Model.RebarSetExtensions.CreateRebarSetSurfaceObjectRelation(Tekla.Structures.Model.RebarSet,System.Int32)
Creates the rebar set/surface object relation.
rebarSet: The rebar set.
surfaceObjectId: The surface object ID.
Returns: The new relation ID.

Tekla.Structures.Model.RebarSetExtensions.SpacingToDotStructs(Tekla.Structures.Model.RebarSpacing,Tekla.Structures.ModelInternal.dotRebarSpacing_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@)
Creates a Tekla.Structures.ModelInternal.dotRebarSpacing_t and a list of Tekla.Structures.ModelInternal.dotSpacingZone_t that contain all the data from the given Tekla.Structures.Model.RebarSpacing
instance in a form that may be transferred to native code.
spacing: The spacing.
dotSpacing: The dot spacing.
dotSpacingZoneList: A list of Tekla.Structures.ModelInternal.dotSpacingZone_ts.

Tekla.Structures.Model.RebarSetExtensions.FromDotStruct(Tekla.Structures.ModelInternal.dotRebarSpacing_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t}@)
Converts a Tekla.Structures.ModelInternal.dotRebarSpacing_t struct to a Tekla.Structures.Model.RebarSpacing class instance.
dotSpacing: The Tekla.Structures.ModelInternal.dotRebarSpacing_t struct.
dotSpacingZoneList: A list of Tekla.Structures.ModelInternal.dotSpacingZone_t structs.
Returns: The Tekla.Structures.Model.RebarSpacing class instance.

Tekla.Structures.Model.RebarSetExtensions.GetActualCurveLength(System.Collections.Generic.IEnumerable{System.Object})
Gets the actual curve length.
curve: The curve.
Returns: The curve length.

Tekla.Structures.Model.RebarSetExtensions.DotStructsToPolycurve(System.Collections.Generic.List{Tekla.Structures.DirectManipulation.Adapter.Native.dotBool},System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t})
Converts data to a polycurve.
isArcList: The is arc flags.
pointList: The points.
Returns: A list of Tekla.Common.Geometry.Segment3 and Tekla.Common.Geometry.Arc3 instances.

Tekla.Structures.Model.RebarSetExtensions.FromDotStruct(System.Collections.Generic.List{Tekla.Structures.DirectManipulation.Adapter.Native.dotBool},System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t})
Converts data to a list of curves.
isArcList: The is arc flags.
pointList: The points.
Returns: A list of Tekla.Common.Geometry.Segment3 and Tekla.Common.Geometry.Arc3 instances.

Tekla.Structures.Model.RebarSetExtensions.FromDotStruct(Tekla.Structures.ModelInternal.dotRebarSet_t,Tekla.Structures.ModelInternal.dotGuideline_t,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t},Tekla.Structures.Model.RebarSet)
Converts dot rebarset structures to a rebarset class.
dotRebarSet: The dot rebar set.
dotGuideline: The dot guideline.
dotSpacingZoneList: The dot spacing zones.
rebarSet: The rebar set.

Tekla.Structures.Model.RebarSetExtensions.ToDotStruct(Tekla.Structures.Model.RebarSet,Tekla.Structures.ModelInternal.dotRebarSet_t@,Tekla.Structures.ModelInternal.dotGuideline_t@,System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotSpacingZone_t})
Converts a rebarset class to dot rebarset structures.
rebarSet: The rebar set.
dotRebarSet: The dot rebar set.
dotGuideline: The dot guideline.
dotSpacingZoneList: The zones.

Tekla.Structures.Model.RebarSetExtensions.FromDotStruct(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t,Tekla.Structures.Model.RebarEndDetailModifier)
Converts an end-detail strip dot struct to a class.
dotStrip: The dot strip.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.ToDotStruct(Tekla.Structures.Model.RebarEndDetailModifier,Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
Converts an end-detail strip class to a dot struct.
strip: The strip.
dotStrip: The dot strip.

Tekla.Structures.Model.RebarSetExtensions.FromDotStruct(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t,Tekla.Structures.Model.RebarPropertyModifier)
Converts a property strip dot struct to a class.
dotStrip: The dot strip.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.ToDotStruct(Tekla.Structures.Model.RebarPropertyModifier,Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
Converts a property strip class to a dot struct.
strip: The strip.
dotStrip: The dot strip.

Tekla.Structures.Model.RebarSetExtensions.FromDotStruct(Tekla.Structures.ModelInternal.dotRebarSplitter_t,Tekla.Structures.Model.RebarSplitter)
Converts a splitter strip dot struct to a class.
dotStrip: The dot strip.
strip: The strip.

Tekla.Structures.Model.RebarSetExtensions.ToDotStruct(Tekla.Structures.Model.RebarSplitter,Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
Converts a splitter strip class to a dot struct.
strip: The strip.
dotStrip: The dot strip.

Tekla.Structures.Model.RebarSetExtensions.GetAppliedUDAs(Tekla.Structures.Model.ModelObject.ModelObjectEnum)
Gets the applied UDAs for a given object type.
type: The object type.
Returns: A dictionary of UDA names/values.